In [4]:
import pandas as pd
import numpy as np

In [5]:
pd.set_option('display.max_colwidth', None)

In [6]:
dflenguage= pd.read_csv(r'C:\Users\flori\Desktop\DATA SCIENCE\LABS\Trabajos\Proyecto_Indiv_1_MLO_Henry\ETL\Language.csv')
dflenguage.head()

      id original_language
0    862                en
1   8844                en
2  15602                en
3  31357                en
4  11862                en

In [7]:
dflenguage.shape

(44936, 2)

In [8]:
lenguage_original = dflenguage['original_language'].unique().tolist()
print(lenguage_original)

['en', 'fr', 'zh', 'it', 'fa', 'nl', 'de', 'cn', 'ar', 'es', 'ru', 'sv', 'ja', 'ko', 'sr', 'bn', 'he', 'pt', 'wo', 'ro', 'hu', 'cy', 'vi', 'cs', 'da', 'no', 'nb', 'pl', 'el', 'sh', 'xx', 'mk', 'bo', 'ca', 'fi', 'th', 'sk', 'bs', 'hi', 'tr', 'is', 'ps', 'ab', 'eo', 'ka', 'mn', 'bm', 'zu', 'uk', 'af', 'la', 'et', 'ku', 'fy', 'lv', 'ta', 'sl', 'tl', 'ur', 'rw', 'id', 'bg', 'mr', 'lt', 'kk', 'ms', 'sq', nan, 'qu', 'te', 'am', 'jv', 'tg', 'ml', 'hr', 'lo', 'ay', 'kn', 'eu', 'ne', 'pa', 'ky', 'gl', 'uz', 'sm', 'mt', 'hy', 'iu', 'lb', 'si']

In [9]:
len(lenguage_original)

90

In [10]:
# Reemplazo los valores numero por Nulo
dflenguage['original_language'].replace('82.0', None, inplace=True)
dflenguage['original_language'].replace('68.0', None , inplace=True)
dflenguage['original_language'].replace('104.0', None , inplace=True)

In [11]:
# elimino Nulos
dflenguage.dropna()

           id original_language
0         862                en
1        8844                en
2       15602                en
3       31357                en
4       11862                en
...       ...               ...
44931   30840                en
44932  111109                tl
44933   67758                en
44934  227506                en
44935  461257                en

[44926 rows x 2 columns]

In [12]:
#cuento cuantos hay de cada uno y los ordeno
grouped = dflenguage[['id','original_language']].groupby('original_language').count()
grouped.sort_values(by= 'id', ascending=False)

                      id
original_language
en                 31893
fr                  2417
it                  1510
ja                  1342
de                  1072
...                  ...
fy                     1
eo                     1
cy                     1
ay                     1
zu                     1

[89 rows x 1 columns]

In [13]:
grouped.to_csv('LenguageCANTIDAD.csv', index=False)

Desanido la columna del lenguage para saber el codigo iso

In [14]:
### no hace falta desanidarrrrr!